# *K*-mean (Using Titanic dataset)

*handling non-numeric dataset*

In [1]:
import numpy as np
import pandas as pd
from sklearn import model_selection , preprocessing , cluster
from sklearn.cluster import KMeans
%matplotlib inline 
from matplotlib import style
style.use('ggplot')
import matplotlib.pyplot as plt

In [15]:
df = pd.read_excel('/home/balerion/Desktop/leetcode_Ai/Ai/dataset/titanic/titanic3.xls')
# print(df.columns)
df.drop(columns=['name' , 'body']  ,axis=1 , inplace=True)
# print(df.head())
print(df.columns.values)
# X = np.array(df.drop(columns=['Survived']))
# y = np.array(df['Survived'])
# df.convert_dtypes(convert_integer=True)
df.fillna(0 , inplace=True)

['pclass' 'survived' 'sex' 'age' 'sibsp' 'parch' 'ticket' 'fare' 'cabin'
 'embarked' 'boat' 'home.dest']

### *Utility fn to handle non-numeric values*

In [16]:
def handle_non_numeric_value(df):
    columns = df.columns.values
    
    for col in columns:
        text_digit_val = {}
        def convert_to_int(val):
            return text_digit_val[val]
        
        if df[col].dtype != np.int64 and df[col].dtype != np.float64:
            column_contents = df[col].values.tolist()
            unique_val = set(column_contents)
            x = 0
            for unq in unique_val:
                if unq not in text_digit_val:
                    text_digit_val[unq] = x
                    x+=1
                    
            df[col] = list(map(convert_to_int , df[col]))  
            
    return df

In [17]:
handle_non_numeric_value(df)

,pclass,survived,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,home.dest
0,1,1,1,29.0000,0,0,737,211.3375,64,2,1,52
1,1,1,0,0.9167,1,2,515,151.5500,100,2,5,308
2,1,0,1,2.0000,1,2,515,151.5500,100,2,0,308
3,1,0,0,30.0000,1,2,515,151.5500,100,2,0,308
4,1,0,1,25.0000,1,2,515,151.5500,100,2,0,308
...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,1,14.5000,1,0,300,14.4542,0,1,0,0
1305,3,0,1,0.0000,1,0,300,14.4542,0,1,0,0
1306,3,0,0,26.5000,0,0,250,7.2250,0,1,0,0
1307,3,0,0,27.0000,0,0,386,7.2250,0,1,0,0
1308,3,0,0,29.0000,0,0,452,7.8750,0,2,0,0